In [1]:
%load_ext sql
%env DATABASE_URL = postgresql://marcio_gabriel:123456@localhost:5432/data_engineering

env: DATABASE_URL=postgresql://marcio_gabriel:123456@localhost:5432/data_engineering

## Overview of Views

In [2]:
%%sql

CREATE OR REPLACE VIEW orders_v
AS
SELECT * FROM orders WHERE order_status = 'COMPLETE'

Done.

[]

In [3]:
%%sql

SELECT * FROM information_schema.tables
WHERE table_name ~ 'orders'

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
124 rows affected.

[('data_engineering', 'public', 'orders', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201601', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201602', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201512', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201603', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201604', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201605', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201606', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201607', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201608', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201609', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201610', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201611', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201612', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201701', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201702', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201703', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201704', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201705', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201706', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201707', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201708', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_default', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_v', 'VIEW', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201709', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201710', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201711', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201712', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201301', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201801', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201302', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201802', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201803', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201804', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201303', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201805', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201304', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201806', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201807', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201305', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201808', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201809', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201810', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201306', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201811', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201307', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201812', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201901', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201902', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201308', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201309', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201903', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201904', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201905', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201906', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201310', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201907', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201311', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201908', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201909', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201910', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201312', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201911', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201401', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201912', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202001', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201402', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202002', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202003', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202004', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201403', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202005', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201404', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202006', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202007', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202008', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201405', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201406', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202009', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202010', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202011', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202012', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201407', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202101', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201408', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202102', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202103', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202104', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201409', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202105', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201410', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202106', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202107', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201411', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202108', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202109', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202110', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201412', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202111', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201501', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202112', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202201', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202202', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201502', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201503', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202203', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202204', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202205', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202206', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201504', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202207', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201505', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202208', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202209', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202210', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201506', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202211', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201507', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_202212', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201508', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201509', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201510', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('data_engineering', 'public', 'orders_part_201511', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

## Named Queries - Using WITH Clause

In [4]:
%%sql

WITH order_details_nq AS (
    SELECT * FROM orders o
        JOIN order_items oi
            on o.order_id = oi.order_item_order_id
) SELECT * FROM order_details_nq LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED', 1, 1, 957, 1, 299.98, 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 2, 2, 1073, 1, 199.99, 199.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 3, 2, 502, 5, 250.0, 50.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 4, 2, 403, 1, 129.99, 129.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 5, 4, 897, 2, 49.98, 24.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 6, 4, 365, 5, 299.95, 59.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 7, 4, 502, 3, 150.0, 50.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 8, 4, 1014, 4, 199.92, 49.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE', 9, 5, 957, 1, 299.98, 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE', 10, 5, 365, 5, 299.95, 59.99)]

In [5]:
%%sql

SELECT * FROM order_details_nq LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
(psycopg2.errors.UndefinedTable) relation "order_details_nq" does not exist
LINE 1: SELECT * FROM order_details_nq LIMIT 10
                      ^

[SQL: SELECT * FROM order_details_nq LIMIT 10]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [6]:
%%sql

WITH order_details_nq AS (
    SELECT * FROM orders o
        JOIN order_items oi
            on o.order_id = oi.order_item_order_id
) SELECT order_date,
    order_item_product_id,
    round(sum(order_item_subtotal)::numeric, 2) AS revenue
FROM order_details_nq 
GROUP BY order_date,
    order_item_product_id
ORDER BY order_date,
    revenue DESC
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('10799.46')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('9599.36')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('8499.15')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('7558.74')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('6999.65')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('6397.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('5589.57')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('5100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('2879.28')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'))]

In [7]:
%%sql

CREATE OR REPLACE VIEW daily_product_revenue_v
AS
WITH order_details_nq AS (
    SELECT * FROM orders o
        JOIN order_items oi
            on o.order_id = oi.order_item_order_id
) SELECT order_date,
    order_item_product_id,
    round(sum(order_item_subtotal)::numeric, 2) AS revenue
FROM order_details_nq 
GROUP BY order_date,
    order_item_product_id

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

## Overview of Sub Queries

In [8]:
%%sql

SELECT * FROM (
    SELECT nq.*,
        dense_rank() OVER (
            PARTITION BY order_date
            ORDER BY revenue DESC
        ) AS drnk
    FROM (
        SELECT o.order_date,
            oi.order_item_product_id,
            round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
        FROM orders o 
            JOIN order_items oi
                ON o.order_id = oi.order_item_order_id
        WHERE o.order_status IN ('COMPLETE', 'CLOSED')
        GROUP BY o.order_date, oi.order_item_product_id
    ) nq
) nq1
WHERE drnk <= 5
ORDER BY order_date, revenue DESC
LIMIT 20

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
20 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 1),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 2),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 3),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 4),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 5),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 1),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 2),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 3),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 4),
 (datetime.datetime(2013, 7, 26, 0, 0), 1014, Decimal('4798.08'), 5),
 (datetime.datetime(2013, 7, 27, 0, 0), 1004, Decimal('9599.52'), 1),
 (datetime.datetime(2013, 7, 27, 0, 0), 191, Decimal('5999.40'), 2),
 (datetime.datetime(2013, 7, 27, 0, 0), 957, Decimal('5699.62'), 3),
 (datetime.datetime(2013, 7, 27, 0, 0), 1073, Decimal('5399.73'), 4),
 (datetime.datetime(2013, 7, 27, 0, 0), 365, Decimal('5099.15'), 5),
 (datetime.datetime(2013, 7, 28, 0, 0), 1004, Decimal('5599.72'), 1),
 (datetime.datetime(2013, 7, 28, 0, 0), 957, Decimal('5099.66'), 2),
 (datetime.datetime(2013, 7, 28, 0, 0), 365, Decimal('4799.20'), 3),
 (datetime.datetime(2013, 7, 28, 0, 0), 403, Decimal('4419.66'), 4),
 (datetime.datetime(2013, 7, 28, 0, 0), 191, Decimal('4299.57'), 5)]

In [9]:
%%sql

SELECT * FROM order_items oi
WHERE oi.order_item_order_id 
    NOT IN (
        SELECT order_id FROM orders o
        WHERE o.order_id = oi.order_item_order_id
    )
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
0 rows affected.

[]

In [10]:
%%sql

SELECT count(1) FROM order_items oi
WHERE oi.order_item_order_id 
    IN (
        SELECT order_id FROM orders o
        WHERE o.order_id = oi.order_item_order_id
    )
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(172198,)]

## CTAS - Create Table as Select

In [11]:
%%sql

CREATE TABLE orders_backup
AS
SELECT order_id,
    to_char(order_date, 'yyyy')::int AS order_year,
    to_char(order_date, 'MM')::int AS order_month,
    to_char(order_date, 'dd')::int AS order_day_of_month,
    to_char(order_date, 'DDD')::int AS order_day_of_year,
    order_customer_id,
    order_status
FROM orders

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
68883 rows affected.

[]

In [12]:
%%sql

SELECT * FROM orders_backup LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, 2013, 7, 25, 206, 11599, 'CLOSED'),
 (2, 2013, 7, 25, 206, 256, 'PENDING_PAYMENT'),
 (3, 2013, 7, 25, 206, 12111, 'COMPLETE'),
 (4, 2013, 7, 25, 206, 8827, 'CLOSED'),
 (5, 2013, 7, 25, 206, 11318, 'COMPLETE'),
 (6, 2013, 7, 25, 206, 7130, 'COMPLETE'),
 (7, 2013, 7, 25, 206, 4530, 'COMPLETE'),
 (8, 2013, 7, 25, 206, 2911, 'PROCESSING'),
 (9, 2013, 7, 25, 206, 5657, 'PENDING_PAYMENT'),
 (10, 2013, 7, 25, 206, 5648, 'PENDING_PAYMENT')]

In [13]:
%%sql

DROP TABLE IF EXISTS customers_backup;
DROP TABLE IF EXISTS orders_backup;
DROP TABLE IF EXISTS order_items_empty;

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.
Done.
Done.

[]

## Advanced DML Operations

In [14]:
%%sql

DROP TABLE IF EXISTS customer_order_metrics_mthly

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [15]:
%%sql

CREATE TABLE customer_order_metrics_mthly (
    customer_id INT,
    order_month CHAR(7),
    order_count INT,
    order_revenue FLOAT
)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [16]:
%%sql

ALTER TABLE customer_order_metrics_mthly
    ADD PRIMARY KEY (order_month, customer_id)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [17]:
%%sql

SELECT o.order_customer_id,
    to_char(o.order_date, 'yyyy-MM') AS order_month,
    count(1) AS order_count,
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
GROUP BY o.order_customer_id,
    to_char(o.order_date, 'yyyy-MM')
ORDER BY order_month,
    order_count DESC
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(5293, '2013-07', 10, Decimal('2781.73')),
 (4257, '2013-07', 10, Decimal('2059.75')),
 (9103, '2013-07', 9, Decimal('1587.85')),
 (7473, '2013-07', 9, Decimal('1244.90')),
 (32, '2013-07', 9, Decimal('2009.75')),
 (488, '2013-07', 9, Decimal('1365.82')),
 (7073, '2013-07', 9, Decimal('1377.83')),
 (2071, '2013-07', 9, Decimal('1629.84')),
 (1498, '2013-07', 8, Decimal('1619.88')),
 (1780, '2013-07', 8, Decimal('1651.85'))]

In [18]:
%%sql

SELECT count(1)
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(172198,)]

In [19]:
%%sql

INSERT INTO customer_order_metrics_mthly
SELECT o.order_customer_id,
    to_char(o.order_date, 'yyyy-MM') AS order_month,
    count(1) order_count,
    NULL
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
GROUP BY o.order_customer_id,
    to_char(o.order_date, 'yyyy-MM')

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
48059 rows affected.

[]

In [20]:
%%sql

SELECT * FROM customer_order_metrics_mthly
ORDER BY order_month,
    customer_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(12, '2013-07', 2, None),
 (16, '2013-07', 1, None),
 (17, '2013-07', 2, None),
 (19, '2013-07', 3, None),
 (32, '2013-07', 9, None),
 (45, '2013-07', 4, None),
 (48, '2013-07', 4, None),
 (54, '2013-07', 2, None),
 (58, '2013-07', 4, None),
 (64, '2013-07', 2, None)]

In [21]:
%%sql

UPDATE customer_order_metrics_mthly comd
SET 
    (order_count, order_revenue) = (
        SELECT count(1),
            round(sum(order_item_subtotal)::numeric, 2)
        FROM orders o 
            JOIN order_items oi
                ON o.order_id = oi.order_item_order_id
        WHERE o.order_customer_id = comd.customer_id
            AND to_char(o.order_date, 'yyyy-MM') = comd.order_month
            AND to_char(o.order_date, 'yyyy-MM') = '2013-08'
            AND comd.order_month = '2013-08'
        GROUP BY o.order_customer_id,
            to_char(o.order_date, 'yyyy-MM')
    )
WHERE EXISTS (
    SELECT 1 FROM orders o
    WHERE o.order_customer_id = comd.customer_id
        AND to_char(o.order_date, 'yyyy-MM') = comd.order_month
        AND to_char(o.order_date, 'yyyy-MM') = '2013-08'
) AND comd.order_month = '2013-08'

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
3935 rows affected.

[]

In [22]:
%%sql

SELECT * FROM customer_order_metrics_mthly
WHERE order_month = '2013-08'
ORDER BY order_month,
    customer_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(2, '2013-08', 5, 769.82),
 (13, '2013-08', 5, 1065.93),
 (14, '2013-08', 3, 459.97),
 (18, '2013-08', 1, 129.99),
 (20, '2013-08', 2, 739.91),
 (22, '2013-08', 5, 769.96),
 (24, '2013-08', 2, 399.91),
 (25, '2013-08', 1, 129.99),
 (33, '2013-08', 3, 929.92),
 (34, '2013-08', 4, 789.92)]

In [23]:
%%sql

DROP TABLE IF EXISTS customers_backup

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [24]:
%%sql

CREATE TABLE customers_backup
AS
SELECT * FROM customers

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
12435 rows affected.

[]

In [25]:
%%sql

SELECT count(1) FROM customers_backup c
    LEFT OUTER JOIN orders o
        ON c.customer_id = o.order_customer_id
WHERE o.order_customer_id IS NULL

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(30,)]

In [26]:
%%sql

SELECT count(1) FROM customers_backup c
WHERE NOT EXISTS (
    SELECT 1 FROM orders o
    WHERE c.customer_id = o.order_customer_id
)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(30,)]

In [27]:
%%sql

DELETE FROM customers_backup c
WHERE NOT EXISTS (
    SELECT 1 FROM orders o
    WHERE c.customer_id = o.order_customer_id
)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
30 rows affected.

[]

In [28]:
%%sql

SELECT count(1) FROM customers_backup

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(12405,)]

In [29]:
%%sql

DELETE FROM customers_backup c
WHERE customer_id NOT IN (
    SELECT order_customer_id FROM orders o
)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
0 rows affected.

[]

## Merging or Upserting Data

In [30]:
%sql DROP TABLE IF EXISTS customer_order_metrics_dly

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [31]:
%%sql

CREATE TABLE customer_order_metrics_dly (
    customer_id INT,
    order_date DATE,
    order_count INT,
    order_revenue FLOAT
)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [32]:
%%sql

ALTER TABLE customer_order_metrics_dly
    ADD PRIMARY KEY (customer_id, order_date)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [33]:
%%sql

INSERT INTO customer_order_metrics_dly
SELECT o.order_customer_id,
    o.order_date,
    count(1) order_count,
    NULL
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE o.order_date BETWEEN '2013-08-01' AND '2013-08-31'
GROUP BY o.order_customer_id,
    o.order_date

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
4708 rows affected.

[]

In [34]:
%%sql

UPDATE customer_order_metrics_dly comd
SET 
    (order_count, order_revenue) = (
        SELECT count(1),
            round(sum(oi.order_item_subtotal)::numeric, 2)
        FROM orders o 
            JOIN order_items oi
                ON o.order_id = oi.order_item_order_id
        WHERE o.order_date BETWEEN '2013-08-01' AND '2013-10-31'
            AND o.order_customer_id = comd.customer_id
            AND o.order_date = comd.order_date
        GROUP BY o.order_customer_id,
            o.order_date
    )
WHERE comd.order_date BETWEEN '2013-08-01' AND '2013-10-31'

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
4708 rows affected.

[]

In [35]:
%%sql

SELECT * FROM customer_order_metrics_dly
ORDER BY order_date, customer_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(34, datetime.date(2013, 8, 1), 4, 789.92),
 (109, datetime.date(2013, 8, 1), 3, 799.9),
 (174, datetime.date(2013, 8, 1), 5, 654.89),
 (267, datetime.date(2013, 8, 1), 4, 559.97),
 (478, datetime.date(2013, 8, 1), 5, 729.9),
 (553, datetime.date(2013, 8, 1), 2, 399.9),
 (692, datetime.date(2013, 8, 1), 2, 479.92),
 (696, datetime.date(2013, 8, 1), 2, 649.88),
 (800, datetime.date(2013, 8, 1), 5, 609.95),
 (835, datetime.date(2013, 8, 1), 5, 589.9)]

In [36]:
%%sql

SELECT to_char(order_date, 'yyyy-MM'), count(1) FROM customer_order_metrics_dly
GROUP BY to_char(order_date, 'yyyy-MM')
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('2013-08', 4708)]

In [37]:
%%sql

INSERT INTO customer_order_metrics_dly
SELECT o.order_customer_id AS customer_id,
    o.order_date,
    count(1) order_count,
    round(sum(order_item_subtotal)::numeric, 2)
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE o.order_date BETWEEN '2013-08-01' AND '2013-10-31'
    AND NOT EXISTS (
        SELECT 1 FROM customer_order_metrics_dly codm
        WHERE o.order_customer_id = codm.customer_id
            AND o.order_date = codm.order_date
    )
GROUP BY o.order_customer_id,
    o.order_date

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
9265 rows affected.

[]

In [38]:
%%sql

SELECT * FROM customer_order_metrics_dly
WHERE order_date::varchar ~ '2013-09'
ORDER BY order_date, customer_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(19, datetime.date(2013, 9, 1), 5, 839.92),
 (95, datetime.date(2013, 9, 1), 5, 969.85),
 (136, datetime.date(2013, 9, 1), 4, 639.94),
 (247, datetime.date(2013, 9, 1), 2, 639.94),
 (383, datetime.date(2013, 9, 1), 5, 729.9),
 (437, datetime.date(2013, 9, 1), 4, 829.97),
 (543, datetime.date(2013, 9, 1), 4, 1489.83),
 (601, datetime.date(2013, 9, 1), 2, 159.99),
 (689, datetime.date(2013, 9, 1), 2, 419.96),
 (842, datetime.date(2013, 9, 1), 4, 954.87)]

In [39]:
%%sql

SELECT to_char(order_date, 'yyyy-MM'), count(1) FROM customer_order_metrics_dly
GROUP BY to_char(order_date, 'yyyy-MM')
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
3 rows affected.

[('2013-08', 4708), ('2013-10', 4417), ('2013-09', 4848)]

In [40]:
%sql TRUNCATE TABLE customer_order_metrics_dly

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [41]:
%%sql

INSERT INTO customer_order_metrics_dly
SELECT o.order_customer_id,
    o.order_date,
    count(1) order_count,
    NULL
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE o.order_date BETWEEN '2013-08-01' AND '2013-08-31'
GROUP BY o.order_customer_id,
    o.order_date

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
4708 rows affected.

[]

In [42]:
%%sql

ALTER TABLE customer_order_metrics_dly DROP CONSTRAINT customer_order_metrics_dly_pkey

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [43]:
%%sql

ALTER TABLE customer_order_metrics_dly
    ADD PRIMARY KEY (customer_id, order_date)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [44]:
%%sql

INSERT INTO customer_order_metrics_dly
SELECT o.order_customer_id,
    o.order_date,
    count(1) order_count,
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE o.order_date BETWEEN '2013-08-01' AND '2013-10-31'
GROUP BY o.order_customer_id,
    o.order_date
ON CONFLICT (customer_id, order_date) DO UPDATE SET
    order_count = EXCLUDED.order_count,
    order_revenue = EXCLUDED.order_revenue

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
13973 rows affected.

[]

In [45]:
%%sql

SELECT * FROM customer_order_metrics_dly
WHERE order_date::varchar ~ '2013-09'
ORDER BY order_date, customer_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(19, datetime.date(2013, 9, 1), 5, 839.92),
 (95, datetime.date(2013, 9, 1), 5, 969.85),
 (136, datetime.date(2013, 9, 1), 4, 639.94),
 (247, datetime.date(2013, 9, 1), 2, 639.94),
 (383, datetime.date(2013, 9, 1), 5, 729.9),
 (437, datetime.date(2013, 9, 1), 4, 829.97),
 (543, datetime.date(2013, 9, 1), 4, 1489.83),
 (601, datetime.date(2013, 9, 1), 2, 159.99),
 (689, datetime.date(2013, 9, 1), 2, 419.96),
 (842, datetime.date(2013, 9, 1), 4, 954.87)]

## Pivoting Rows into Columns

In [46]:
%%sql

SELECT * FROM crosstab(
    'SELECT order_date,
        order_status,
        count(1) AS order_count
    FROM orders
    GROUP BY order_date,
        order_status',
    'SELECT DISTINCT order_status FROM orders ORDER BY 1'
) AS (
    order_date DATE,
    "CANCELED" INT,
    "CLOSED" INT,
    "COMPLETE" INT,
    "ON_HOLD" INT,
    "PAYMENT_REVIEW" INT,
    "PENDING" INT,
    "PENDING_PAYMENT" INT,
    "PROCESSING" INT,
    "SUSPECTED_FRAUD" INT
)
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
(psycopg2.errors.UndefinedFunction) function crosstab(unknown, unknown) does not exist
LINE 1: SELECT * FROM crosstab(
                      ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: SELECT * FROM crosstab(
    'SELECT order_date,
        order_status,
        count(1) AS order_count
    FROM orders
    GROUP BY order_date,
        order_status',
    'SELECT DISTINCT order_status FROM orders ORDER BY 1'
) AS (
    order_date DATE,
    "CANCELED" INT,
    "CLOSED" INT,
    "COMPLETE" INT,
    "ON_HOLD" INT,
    "PAYMENT_REVIEW" INT,
    "PENDING" INT,
    "PENDING_PAYMENT" INT,
    "PROCESSING" INT,
    "SUSPECTED_FRAUD" INT
)
LIMIT 10]
(Background on this error at: https://sqlalche.me/e/14/f405)

## Overview of Analytic Functions

In [47]:
%%sql

DROP TABLE IF EXISTS daily_revenue

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [48]:
%%sql

CREATE TABLE daily_revenue
AS
SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
364 rows affected.

[]

In [49]:
%%sql

SELECT * FROM daily_revenue
ORDER BY order_date
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'))]

In [50]:
%%sql

DROP TABLE IF EXISTS daily_product_revenue

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [51]:
%%sql

CREATE TABLE daily_product_revenue
AS
SELECT o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date, oi.order_item_product_id

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
9120 rows affected.

[]

In [52]:
%%sql

SELECT * FROM daily_product_revenue
ORDER BY order_date, revenue DESC
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'))]

## Analytic Functions  Aggregations

In [53]:
%%sql

SELECT employee_id, department_id, salary 
FROM employees 
ORDER BY department_id, salary
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(200, 10, Decimal('4400.00')),
 (202, 20, Decimal('6000.00')),
 (201, 20, Decimal('13000.00')),
 (119, 30, Decimal('2500.00')),
 (118, 30, Decimal('2600.00')),
 (117, 30, Decimal('2800.00')),
 (116, 30, Decimal('2900.00')),
 (115, 30, Decimal('3100.00')),
 (114, 30, Decimal('11000.00')),
 (203, 40, Decimal('6500.00'))]

In [54]:
%%sql

SELECT department_id,
    sum(salary) AS department_salary_expense
FROM employees
GROUP BY department_id
ORDER BY department_id

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
12 rows affected.

[(10, Decimal('4400.00')),
 (20, Decimal('19000.00')),
 (30, Decimal('24900.00')),
 (40, Decimal('6500.00')),
 (50, Decimal('156400.00')),
 (60, Decimal('28800.00')),
 (70, Decimal('10000.00')),
 (80, Decimal('304500.00')),
 (90, Decimal('58000.00')),
 (100, Decimal('51600.00')),
 (110, Decimal('20300.00')),
 (None, Decimal('7000.00'))]

In [55]:
%%sql

SELECT e.employee_id, e.department_id, e.salary,
    ae.department_salary_expense,
    ae.avg_salary_expense
FROM employees e JOIN (
    SELECT department_id, 
        sum(salary) AS department_salary_expense,
        round(avg(salary)::numeric, 2) AS avg_salary_expense
    FROM employees
    GROUP BY department_id
) ae
ON e.department_id = ae.department_id
ORDER BY department_id, salary
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(200, 10, Decimal('4400.00'), Decimal('4400.00'), Decimal('4400.00')),
 (202, 20, Decimal('6000.00'), Decimal('19000.00'), Decimal('9500.00')),
 (201, 20, Decimal('13000.00'), Decimal('19000.00'), Decimal('9500.00')),
 (119, 30, Decimal('2500.00'), Decimal('24900.00'), Decimal('4150.00')),
 (118, 30, Decimal('2600.00'), Decimal('24900.00'), Decimal('4150.00')),
 (117, 30, Decimal('2800.00'), Decimal('24900.00'), Decimal('4150.00')),
 (116, 30, Decimal('2900.00'), Decimal('24900.00'), Decimal('4150.00')),
 (115, 30, Decimal('3100.00'), Decimal('24900.00'), Decimal('4150.00')),
 (114, 30, Decimal('11000.00'), Decimal('24900.00'), Decimal('4150.00')),
 (203, 40, Decimal('6500.00'), Decimal('6500.00'), Decimal('6500.00'))]

In [56]:
%%sql

SELECT e.employee_id, e.department_id, e.salary,
    ae.department_salary_expense,
    ae.avg_salary_expense,
    round(e.salary/ae.department_salary_expense * 100, 2) pct_salary
FROM employees e JOIN (
    SELECT department_id, 
        sum(salary) AS department_salary_expense,
        round(avg(salary)::numeric, 2) AS avg_salary_expense
    FROM employees
    GROUP BY department_id
) ae
ON e.department_id = ae.department_id
ORDER BY department_id, salary
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(200, 10, Decimal('4400.00'), Decimal('4400.00'), Decimal('4400.00'), Decimal('100.00')),
 (202, 20, Decimal('6000.00'), Decimal('19000.00'), Decimal('9500.00'), Decimal('31.58')),
 (201, 20, Decimal('13000.00'), Decimal('19000.00'), Decimal('9500.00'), Decimal('68.42')),
 (119, 30, Decimal('2500.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('10.04')),
 (118, 30, Decimal('2600.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('10.44')),
 (117, 30, Decimal('2800.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('11.24')),
 (116, 30, Decimal('2900.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('11.65')),
 (115, 30, Decimal('3100.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('12.45')),
 (114, 30, Decimal('11000.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('44.18')),
 (203, 40, Decimal('6500.00'), Decimal('6500.00'), Decimal('6500.00'), Decimal('100.00'))]

In [57]:
%%sql

SELECT e.employee_id, e.department_id, e.salary,
    sum(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS department_salary_expense
FROM employees e
ORDER BY e.department_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(200, 10, Decimal('4400.00'), Decimal('4400.00')),
 (201, 20, Decimal('13000.00'), Decimal('19000.00')),
 (202, 20, Decimal('6000.00'), Decimal('19000.00')),
 (114, 30, Decimal('11000.00'), Decimal('24900.00')),
 (115, 30, Decimal('3100.00'), Decimal('24900.00')),
 (116, 30, Decimal('2900.00'), Decimal('24900.00')),
 (117, 30, Decimal('2800.00'), Decimal('24900.00')),
 (118, 30, Decimal('2600.00'), Decimal('24900.00')),
 (119, 30, Decimal('2500.00'), Decimal('24900.00')),
 (203, 40, Decimal('6500.00'), Decimal('6500.00'))]

In [58]:
%%sql

SELECT e.employee_id, e.department_id, e.salary,
    sum(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS department_salary_expense,
    round(e.salary / sum(e.salary) OVER (
        PARTITION BY e.department_id
    ) * 100, 2) AS pct_salary
FROM employees e
ORDER BY e.department_id,
    e.salary
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(200, 10, Decimal('4400.00'), Decimal('4400.00'), Decimal('100.00')),
 (202, 20, Decimal('6000.00'), Decimal('19000.00'), Decimal('31.58')),
 (201, 20, Decimal('13000.00'), Decimal('19000.00'), Decimal('68.42')),
 (119, 30, Decimal('2500.00'), Decimal('24900.00'), Decimal('10.04')),
 (118, 30, Decimal('2600.00'), Decimal('24900.00'), Decimal('10.44')),
 (117, 30, Decimal('2800.00'), Decimal('24900.00'), Decimal('11.24')),
 (116, 30, Decimal('2900.00'), Decimal('24900.00'), Decimal('11.65')),
 (115, 30, Decimal('3100.00'), Decimal('24900.00'), Decimal('12.45')),
 (114, 30, Decimal('11000.00'), Decimal('24900.00'), Decimal('44.18')),
 (203, 40, Decimal('6500.00'), Decimal('6500.00'), Decimal('100.00'))]

In [59]:
%%sql

SELECT e.employee_id, e.department_id, e.salary,
    sum(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS sum_sal_expense,
    round(avg(e.salary) OVER (
        PARTITION BY e.department_id
    ), 2) AS avg_sal_expense,
    min(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS min_sal_expense,
    max(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS max_sal_expense,
    count(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS cnt_sal_expense
FROM employees e
ORDER BY e.department_id,
    e.salary
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(200, 10, Decimal('4400.00'), Decimal('4400.00'), Decimal('4400.00'), Decimal('4400.00'), Decimal('4400.00'), 1),
 (202, 20, Decimal('6000.00'), Decimal('19000.00'), Decimal('9500.00'), Decimal('6000.00'), Decimal('13000.00'), 2),
 (201, 20, Decimal('13000.00'), Decimal('19000.00'), Decimal('9500.00'), Decimal('6000.00'), Decimal('13000.00'), 2),
 (119, 30, Decimal('2500.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('2500.00'), Decimal('11000.00'), 6),
 (118, 30, Decimal('2600.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('2500.00'), Decimal('11000.00'), 6),
 (117, 30, Decimal('2800.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('2500.00'), Decimal('11000.00'), 6),
 (116, 30, Decimal('2900.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('2500.00'), Decimal('11000.00'), 6),
 (115, 30, Decimal('3100.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('2500.00'), Decimal('11000.00'), 6),
 (114, 30, Decimal('11000.00'), Decimal('24900.00'), Decimal('4150.00'), Decimal('2500.00'), Decimal('11000.00'), 6),
 (203, 40, Decimal('6500.00'), Decimal('6500.00'), Decimal('6500.00'), Decimal('6500.00'), Decimal('6500.00'), 1)]

## Cumulative or Moving Aggregations

In [60]:
%%sql

SELECT e.employee_id, e.department_id, e.salary,
    sum(e.salary) OVER (
        PARTITION BY e.department_id
        ORDER BY e.salary
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS sum_sal_expense
FROM employees e
ORDER BY e.department_id, e.salary DESC
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(200, 10, Decimal('4400.00'), Decimal('4400.00')),
 (201, 20, Decimal('13000.00'), Decimal('19000.00')),
 (202, 20, Decimal('6000.00'), Decimal('6000.00')),
 (114, 30, Decimal('11000.00'), Decimal('24900.00')),
 (115, 30, Decimal('3100.00'), Decimal('13900.00')),
 (116, 30, Decimal('2900.00'), Decimal('10800.00')),
 (117, 30, Decimal('2800.00'), Decimal('7900.00')),
 (118, 30, Decimal('2600.00'), Decimal('5100.00')),
 (119, 30, Decimal('2500.00'), Decimal('2500.00')),
 (203, 40, Decimal('6500.00'), Decimal('6500.00'))]

In [61]:
%%sql

SELECT t.*,
    round(sum(t.revenue) OVER (
        PARTITION BY to_char(order_date, 'yyyy-MM')
        ORDER BY order_date
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ), 2) AS cumulative_daily_revenue
FROM daily_revenue t
ORDER BY to_char(order_date, 'yyyy-MM'),
    order_date
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), Decimal('86260.46')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), Decimal('134671.94')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), Decimal('170343.97')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), Decimal('224923.67')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), Decimal('274252.96')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), Decimal('333465.45')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), Decimal('49160.08')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), Decimal('99848.66')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), Decimal('143265.40'))]

In [62]:
%%sql

SELECT t.*,
    round(sum(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
20 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), Decimal('86260.46')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), Decimal('134671.94')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), Decimal('138796.74')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), Decimal('138663.21')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), Decimal('139581.02')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), Decimal('163121.48')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), Decimal('157701.86')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), Decimal('159061.15')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), Decimal('143265.40')),
 (datetime.datetime(2013, 8, 4, 0, 0), Decimal('35093.01'), Decimal('129198.33')),
 (datetime.datetime(2013, 8, 5, 0, 0), Decimal('34025.27'), Decimal('112535.02')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89'), Decimal('126962.17')),
 (datetime.datetime(2013, 8, 7, 0, 0), Decimal('45525.59'), Decimal('137394.75')),
 (datetime.datetime(2013, 8, 8, 0, 0), Decimal('33549.47'), Decimal('136918.95')),
 (datetime.datetime(2013, 8, 9, 0, 0), Decimal('29225.16'), Decimal('108300.22')),
 (datetime.datetime(2013, 8, 10, 0, 0), Decimal('46435.04'), Decimal('109209.67')),
 (datetime.datetime(2013, 8, 11, 0, 0), Decimal('31155.50'), Decimal('106815.70')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74'), Decimal('136605.28')),
 (datetime.datetime(2013, 8, 13, 0, 0), Decimal('17956.88'), Decimal('108127.12'))]

In [63]:
%%sql

SELECT t.*,
    round(sum(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND 2 FOLLOWING
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
20 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), Decimal('134671.94')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), Decimal('170343.97')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), Decimal('224923.67')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), Decimal('242705.73')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), Decimal('247204.99')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), Decimal('247953.59')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), Decimal('262970.14')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), Decimal('251807.18')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), Decimal('237570.90')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), Decimal('212383.68')),
 (datetime.datetime(2013, 8, 4, 0, 0), Decimal('35093.01'), Decimal('221067.49')),
 (datetime.datetime(2013, 8, 5, 0, 0), Decimal('34025.27'), Decimal('215904.50')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89'), Decimal('206037.23')),
 (datetime.datetime(2013, 8, 7, 0, 0), Decimal('45525.59'), Decimal('200169.38')),
 (datetime.datetime(2013, 8, 8, 0, 0), Decimal('33549.47'), Decimal('212579.15')),
 (datetime.datetime(2013, 8, 9, 0, 0), Decimal('29225.16'), Decimal('185890.76')),
 (datetime.datetime(2013, 8, 10, 0, 0), Decimal('46435.04'), Decimal('199379.91')),
 (datetime.datetime(2013, 8, 11, 0, 0), Decimal('31155.50'), Decimal('183787.32')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74'), Decimal('196605.61')),
 (datetime.datetime(2013, 8, 13, 0, 0), Decimal('17956.88'), Decimal('199737.25'))]

In [64]:
%%sql

SELECT t.*,
    round(avg(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
20 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), Decimal('43130.23')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), Decimal('44890.65')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), Decimal('46265.58')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), Decimal('46221.07')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), Decimal('46527.01')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), Decimal('54373.83')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), Decimal('52567.29')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), Decimal('53020.38')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), Decimal('47755.13')),
 (datetime.datetime(2013, 8, 4, 0, 0), Decimal('35093.01'), Decimal('43066.11')),
 (datetime.datetime(2013, 8, 5, 0, 0), Decimal('34025.27'), Decimal('37511.67')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89'), Decimal('42320.72')),
 (datetime.datetime(2013, 8, 7, 0, 0), Decimal('45525.59'), Decimal('45798.25')),
 (datetime.datetime(2013, 8, 8, 0, 0), Decimal('33549.47'), Decimal('45639.65')),
 (datetime.datetime(2013, 8, 9, 0, 0), Decimal('29225.16'), Decimal('36100.07')),
 (datetime.datetime(2013, 8, 10, 0, 0), Decimal('46435.04'), Decimal('36403.22')),
 (datetime.datetime(2013, 8, 11, 0, 0), Decimal('31155.50'), Decimal('35605.23')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74'), Decimal('45535.09')),
 (datetime.datetime(2013, 8, 13, 0, 0), Decimal('17956.88'), Decimal('36042.37'))]

## Analytic Functions  Windowing

In [65]:
%%sql

SELECT t.*,
    lead(order_date) OVER (ORDER BY order_date DESC) AS prior_date,
    lead(revenue) OVER (ORDER BY order_date DESC) AS prior_revenue,
    lag(order_date) OVER (ORDER BY order_date) AS lag_prior_date,
    lag(revenue) OVER (ORDER BY order_date) AS lag_prior_revenue
FROM daily_revenue AS t
ORDER BY order_date DESC
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2014, 7, 24, 0, 0), Decimal('50885.19'), datetime.datetime(2014, 7, 23, 0, 0), Decimal('38795.23'), datetime.datetime(2014, 7, 23, 0, 0), Decimal('38795.23')),
 (datetime.datetime(2014, 7, 23, 0, 0), Decimal('38795.23'), datetime.datetime(2014, 7, 22, 0, 0), Decimal('36717.24'), datetime.datetime(2014, 7, 22, 0, 0), Decimal('36717.24')),
 (datetime.datetime(2014, 7, 22, 0, 0), Decimal('36717.24'), datetime.datetime(2014, 7, 21, 0, 0), Decimal('51427.70'), datetime.datetime(2014, 7, 21, 0, 0), Decimal('51427.70')),
 (datetime.datetime(2014, 7, 21, 0, 0), Decimal('51427.70'), datetime.datetime(2014, 7, 20, 0, 0), Decimal('60047.45'), datetime.datetime(2014, 7, 20, 0, 0), Decimal('60047.45')),
 (datetime.datetime(2014, 7, 20, 0, 0), Decimal('60047.45'), datetime.datetime(2014, 7, 19, 0, 0), Decimal('38420.99'), datetime.datetime(2014, 7, 19, 0, 0), Decimal('38420.99')),
 (datetime.datetime(2014, 7, 19, 0, 0), Decimal('38420.99'), datetime.datetime(2014, 7, 18, 0, 0), Decimal('43856.60'), datetime.datetime(2014, 7, 18, 0, 0), Decimal('43856.60')),
 (datetime.datetime(2014, 7, 18, 0, 0), Decimal('43856.60'), datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77'), datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77')),
 (datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77'), datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92'), datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92')),
 (datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92'), datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23'), datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23')),
 (datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23'), datetime.datetime(2014, 7, 14, 0, 0), Decimal('29937.52'), datetime.datetime(2014, 7, 14, 0, 0), Decimal('29937.52'))]

In [66]:
%%sql

SELECT t.*,
    lead(order_date, 7) OVER (ORDER BY order_date DESC) AS prior_date,
    lead(revenue, 7) OVER (ORDER BY order_date DESC) AS prior_revenue
FROM daily_revenue t
ORDER BY order_date DESC
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2014, 7, 24, 0, 0), Decimal('50885.19'), datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77')),
 (datetime.datetime(2014, 7, 23, 0, 0), Decimal('38795.23'), datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92')),
 (datetime.datetime(2014, 7, 22, 0, 0), Decimal('36717.24'), datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23')),
 (datetime.datetime(2014, 7, 21, 0, 0), Decimal('51427.70'), datetime.datetime(2014, 7, 14, 0, 0), Decimal('29937.52')),
 (datetime.datetime(2014, 7, 20, 0, 0), Decimal('60047.45'), datetime.datetime(2014, 7, 13, 0, 0), Decimal('40410.99')),
 (datetime.datetime(2014, 7, 19, 0, 0), Decimal('38420.99'), datetime.datetime(2014, 7, 12, 0, 0), Decimal('38449.77')),
 (datetime.datetime(2014, 7, 18, 0, 0), Decimal('43856.60'), datetime.datetime(2014, 7, 11, 0, 0), Decimal('29596.32')),
 (datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77'), datetime.datetime(2014, 7, 10, 0, 0), Decimal('47826.02')),
 (datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92'), datetime.datetime(2014, 7, 9, 0, 0), Decimal('36929.91')),
 (datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23'), datetime.datetime(2014, 7, 8, 0, 0), Decimal('50434.81'))]

In [67]:
%%sql

SELECT t.*,
    lead(order_date, 7) OVER (ORDER BY order_date DESC) AS prior_date,
    lead(revenue, 7, 0.0) OVER (ORDER BY order_date DESC) AS prior_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), None, Decimal('0.0')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'))]

In [68]:
%%sql

SELECT t.*,
    LEAD(order_item_product_id) OVER (
        PARTITION BY order_date 
        ORDER BY revenue DESC
    ) next_product_id,
    LEAD(revenue) OVER (
        PARTITION BY order_date 
        ORDER BY revenue DESC
    ) next_revenue
FROM daily_product_revenue t
ORDER BY order_date, revenue DESC
LIMIT 30

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
30 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 1073, Decimal('2999.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 1014, Decimal('2798.88')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88'), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85'), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00'), 627, Decimal('1079.73')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73'), 226, Decimal('599.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'), 24, Decimal('319.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96'), 821, Decimal('207.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 821, Decimal('207.96'), 625, Decimal('199.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'), 705, Decimal('119.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 705, Decimal('119.99'), 572, Decimal('119.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97'), 666, Decimal('109.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 666, Decimal('109.99'), 725, Decimal('108.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 725, Decimal('108.00'), 134, Decimal('100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00'), 906, Decimal('99.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 906, Decimal('99.96'), 828, Decimal('95.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 828, Decimal('95.97'), 810, Decimal('79.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 810, Decimal('79.96'), 924, Decimal('79.95')),
 (datetime.datetime(2013, 7, 25, 0, 0), 924, Decimal('79.95'), 926, Decimal('79.95')),
 (datetime.datetime(2013, 7, 25, 0, 0), 926, Decimal('79.95'), 93, Decimal('74.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97'), 835, Decimal('63.98')),
 (datetime.datetime(2013, 7, 25, 0, 0), 835, Decimal('63.98'), 897, Decimal('49.98')),
 (datetime.datetime(2013, 7, 25, 0, 0), 897, Decimal('49.98'), None, None),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 365, Decimal('7978.67')),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 957, Decimal('6899.54')),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 191, Decimal('6799.32')),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 1014, Decimal('4798.08'))]

In [69]:
%%sql

SELECT t.*,
    last_value(order_item_product_id) OVER (
        PARTITION BY order_date ORDER BY revenue    
        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING
    ) last_product_id,
    max(revenue) OVER (
        PARTITION BY order_date
    ) last_revenue
FROM daily_product_revenue AS t
ORDER BY order_date, revenue DESC
LIMIT 30

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
30 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 821, Decimal('207.96'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 705, Decimal('119.99'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 666, Decimal('109.99'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 725, Decimal('108.00'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 906, Decimal('99.96'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 828, Decimal('95.97'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 810, Decimal('79.96'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 926, Decimal('79.95'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 924, Decimal('79.95'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 835, Decimal('63.98'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 897, Decimal('49.98'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 1004, Decimal('10799.46')),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 1004, Decimal('10799.46')),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 1004, Decimal('10799.46')),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 1004, Decimal('10799.46'))]

## Analytic Functions  Ranking

In [70]:
%%sql

SELECT t.*,
    rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) AS rnk
FROM daily_product_revenue t
ORDER BY order_date, revenue DESC
LIMIT 30

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
30 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 1),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 2),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 3),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 4),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 5),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88'), 6),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85'), 7),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00'), 8),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73'), 9),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'), 10),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96'), 11),
 (datetime.datetime(2013, 7, 25, 0, 0), 821, Decimal('207.96'), 12),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'), 13),
 (datetime.datetime(2013, 7, 25, 0, 0), 705, Decimal('119.99'), 14),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97'), 15),
 (datetime.datetime(2013, 7, 25, 0, 0), 666, Decimal('109.99'), 16),
 (datetime.datetime(2013, 7, 25, 0, 0), 725, Decimal('108.00'), 17),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00'), 18),
 (datetime.datetime(2013, 7, 25, 0, 0), 906, Decimal('99.96'), 19),
 (datetime.datetime(2013, 7, 25, 0, 0), 828, Decimal('95.97'), 20),
 (datetime.datetime(2013, 7, 25, 0, 0), 810, Decimal('79.96'), 21),
 (datetime.datetime(2013, 7, 25, 0, 0), 924, Decimal('79.95'), 22),
 (datetime.datetime(2013, 7, 25, 0, 0), 926, Decimal('79.95'), 22),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97'), 24),
 (datetime.datetime(2013, 7, 25, 0, 0), 835, Decimal('63.98'), 25),
 (datetime.datetime(2013, 7, 25, 0, 0), 897, Decimal('49.98'), 26),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 1),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 2),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 3),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 4)]

In [71]:
%%sql

SELECT employee_id, department_id, salary,
    rank() OVER (
        PARTITION BY department_id 
        ORDER BY salary DESC
    ) AS rnk
FROM employees
LIMIT 20

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
20 rows affected.

[(200, 10, Decimal('4400.00'), 1),
 (201, 20, Decimal('13000.00'), 1),
 (202, 20, Decimal('6000.00'), 2),
 (114, 30, Decimal('11000.00'), 1),
 (115, 30, Decimal('3100.00'), 2),
 (116, 30, Decimal('2900.00'), 3),
 (117, 30, Decimal('2800.00'), 4),
 (118, 30, Decimal('2600.00'), 5),
 (119, 30, Decimal('2500.00'), 6),
 (203, 40, Decimal('6500.00'), 1),
 (121, 50, Decimal('8200.00'), 1),
 (120, 50, Decimal('8000.00'), 2),
 (122, 50, Decimal('7900.00'), 3),
 (123, 50, Decimal('6500.00'), 4),
 (124, 50, Decimal('5800.00'), 5),
 (184, 50, Decimal('4200.00'), 6),
 (185, 50, Decimal('4100.00'), 7),
 (192, 50, Decimal('4000.00'), 8),
 (193, 50, Decimal('3900.00'), 9),
 (188, 50, Decimal('3800.00'), 10)]

In [72]:
%%sql

SELECT employee_id, department_id, salary,
    dense_rank() OVER (
        PARTITION BY department_id 
        ORDER BY salary DESC
    ) AS drnk
FROM employees
LIMIT 20

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
20 rows affected.

[(200, 10, Decimal('4400.00'), 1),
 (201, 20, Decimal('13000.00'), 1),
 (202, 20, Decimal('6000.00'), 2),
 (114, 30, Decimal('11000.00'), 1),
 (115, 30, Decimal('3100.00'), 2),
 (116, 30, Decimal('2900.00'), 3),
 (117, 30, Decimal('2800.00'), 4),
 (118, 30, Decimal('2600.00'), 5),
 (119, 30, Decimal('2500.00'), 6),
 (203, 40, Decimal('6500.00'), 1),
 (121, 50, Decimal('8200.00'), 1),
 (120, 50, Decimal('8000.00'), 2),
 (122, 50, Decimal('7900.00'), 3),
 (123, 50, Decimal('6500.00'), 4),
 (124, 50, Decimal('5800.00'), 5),
 (184, 50, Decimal('4200.00'), 6),
 (185, 50, Decimal('4100.00'), 7),
 (192, 50, Decimal('4000.00'), 8),
 (193, 50, Decimal('3900.00'), 9),
 (188, 50, Decimal('3800.00'), 10)]

In [73]:
%%sql

SELECT employee_id, department_id, salary,
    rank() OVER (
        ORDER BY salary DESC
    ) AS rnk,
    dense_rank() OVER (
        ORDER BY salary DESC
    ) AS drnk
FROM employees
LIMIT 20

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
20 rows affected.

[(100, 90, Decimal('24000.00'), 1, 1),
 (101, 90, Decimal('17000.00'), 2, 2),
 (102, 90, Decimal('17000.00'), 2, 2),
 (145, 80, Decimal('14000.00'), 4, 3),
 (146, 80, Decimal('13500.00'), 5, 4),
 (201, 20, Decimal('13000.00'), 6, 5),
 (205, 110, Decimal('12000.00'), 7, 6),
 (147, 80, Decimal('12000.00'), 7, 6),
 (108, 100, Decimal('12000.00'), 7, 6),
 (168, 80, Decimal('11500.00'), 10, 7),
 (148, 80, Decimal('11000.00'), 11, 8),
 (174, 80, Decimal('11000.00'), 11, 8),
 (114, 30, Decimal('11000.00'), 11, 8),
 (149, 80, Decimal('10500.00'), 14, 9),
 (162, 80, Decimal('10500.00'), 14, 9),
 (169, 80, Decimal('10000.00'), 16, 10),
 (204, 70, Decimal('10000.00'), 16, 10),
 (150, 80, Decimal('10000.00'), 16, 10),
 (156, 80, Decimal('10000.00'), 16, 10),
 (170, 80, Decimal('9600.00'), 20, 11)]

## Analytic Functions - Filtering

In [74]:
%%sql

SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date
ORDER BY o.order_date
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'))]

In [75]:
%%sql

SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date
    HAVING round(sum(oi.order_item_subtotal)::numeric, 2) >= 50000
ORDER BY order_date
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74')),
 (datetime.datetime(2013, 8, 17, 0, 0), Decimal('63226.83')),
 (datetime.datetime(2013, 8, 24, 0, 0), Decimal('52650.15')),
 (datetime.datetime(2013, 9, 5, 0, 0), Decimal('59942.43')),
 (datetime.datetime(2013, 9, 6, 0, 0), Decimal('61976.10'))]